In [1]:
import pandas as pd
import numpy as np
from faker import Faker
import random

In [2]:
faker = Faker()
f = Faker(["de_DE"])

# Deapartments

In [35]:
subjects = ['Mathematics','Physics',  'Agriculture', 'Animal Science', 'Food Science', 'Forestry', 'Marine Biology', 'Veterinary Medicine' ,
    'Chemistry','Biology', 'Computer Science', 'Engineering', 'Psychology', 'Sociology', 'Economics' , 'Political Science', 'History',
    'English Literature', 'Foreign Languages', 'Philosophy', 'Art History', 'Music', 'Film Studies', 'Business Administration',
    'Marketing', 'Finance', 'Accounting', 'Management', 'Human Resources', 'Entrepreneurship', 'Environmental Science', 'Geology',
    'Astronomy', 'Anthropology', 'Archaeology', 'Education', 'Health Sciences', 'Nursing', 'Medicine', 'Dentistry', 'Pharmacy', 'Law',
    'Theater', 'Dance', 'Physical Education', 'Nutrition', 'Communication Studies', 'Media Studies', 'Information Technology',
    'Statistics', 'Geography', 'Urban Planning', 'Public Administration', 'Social Work', 'Criminal Justice', 'Religious Studies', 'Womens Studies',
    'Gender Studies', 'Architecture', 'Urban Design', 'Linguistics', 'Public Health', 'Industrial Engineering', 'Mechanical Engineering', 
    'Civil Engineering', 'Electrical Engineering', 'Chemical Engineering', 'Materials Science and Engineering',
    'Biomedical Engineering', 'Environmental Engineering', 'Computer Engineering', 'Robotics',  'Biotechnology',
    'Bioinformatics', 'Neuroscience', 'Cognitive Science', 'Developmental Biology', 'Genomics', 'Humanities',
    'Fine Arts', 'Graphic Design', 'Interior Design', 'Fashion Design',  'Industrial Design', 'Digital Media',
    'Animation', 'Game Design',  'Sports Science', 'Kinesiology',  'Rehabilitation Science', 'Library Science',
    'Information Science', 'Archival Science', 'Data Science', 'Machine Learning', 'Artificial Intelligence', 
    'Cybersecurity', 'Network Security', 'Forensic Science', 'Criminology', 'Counterterrorism', 'International Law',
    'Human Rights Law', 'Intellectual Property Law', 'Health Law', 'Immigration Law',  'Family Law',  'Corporate Law',
    'Real Estate Law', 'Tax Law', 'Maritime Law', 'Space Law']

In [68]:
len(subjects)
department_id = []

In [69]:
for i in range(112):
    department_id.append(faker.unique.random_int(min = 3200, max= 3400))

In [70]:
len(department_id)

112

In [71]:
department_name = []
department_name.extend(subjects)

In [72]:
no_of_staff_members = []
HOD = []
coordinator = []
no_of_labrotatries = []
year_of_inclusion = []
no_of_students = []
stream_of_department = []

In [73]:
print(len(no_of_labrotatries))

0

In [74]:
for i in range(112):
    no_of_staff_members.append(faker.random_int(min = 16 , max =32))
    HOD.append(faker.name())
    coordinator.append(faker.name())
    no_of_labrotatries.append(faker.random_int(min = 3 , max = 9))
    year_of_inclusion.append(faker.date_between_dates("-75y", "-30y"))
    no_of_students.append(faker.random_int(min = 150 , max = 490))
    stream_of_department.append(random.choice(stream_name))

In [75]:
departments = {"id_": department_id , "department": department_name, "Staff_members_strength": no_of_staff_members , 
              "Head_of_Department": HOD, "coordinator_name": coordinator, "no_of_labrotatries" : no_of_labrotatries, 
              "year_of_inclusion" : year_of_inclusion,  "no_of_students": no_of_students, "Stream": stream_of_department}

In [76]:
df_departments = pd.DataFrame(departments)

In [77]:
df_departments.to_csv("Departments.csv")

In [78]:
df_departments

,id_,department,Staff_members_strength,Head_of_Department,coordinator_name,no_of_labrotatries,year_of_inclusion,no_of_students,Stream
0,3204,Mathematics,16,Ashley Marshall,Thomas Benson,9,1965-06-05,220,Non_Medical
1,3394,Physics,26,Paul Jimenez,Stacey Schmitt,9,1972-05-09,312,Humanitarian
2,3341,Agriculture,24,Stacy Trevino,Mrs. Kristin Young DVM,8,1961-12-12,408,Social_Work
3,3246,Animal Science,32,Cameron Greene,Jeremy King,9,1962-12-03,194,Medical
4,3226,Food Science,28,Timothy Valdez,Laura Rodriguez,9,1980-06-08,162,Medical
...,...,...,...,...,...,...,...,...,...
107,3286,Corporate Law,20,William Acevedo,Laura Ramirez,5,1957-11-15,485,Humanitarian
108,3299,Real Estate Law,22,Logan Oconnor,Randy Mccarthy,5,1992-08-10,194,Non_Medical
109,3353,Tax Law,23,Justin Mccoy,David Bray,4,1954-11-23,301,Social_Work
110,3307,Maritime Law,18,Tamara Fleming MD,Rachel Parker,6,1959-04-13,453,Social_Work
111,3306,Space Law,20,Nicole Oliver,Wanda Trevino,3,1960-07-02,289,Humanitarian

# Streams

In [44]:
stream_id = [1,2,3,4,5]
stream_name = ["Medical", "Non_Medical", "Humanitarian", "Arts", "Social_Work"]
established_year = ["1951", "1951", "1951", "1951", "1975"]

In [45]:
stream = {"stream_id": stream_id, "stream_name": stream_name, "established_year" : established_year}

In [46]:
df_stream = pd.DataFrame(stream)

In [203]:
df_stream.to_csv("Stream.csv")

In [48]:
df_stream

   stream_id   stream_name established_year
0          1       Medical             1951
1          2   Non_Medical             1951
2          3  Humanitarian             1951
3          4          Arts             1951
4          5   Social_Work             1975

# faculty

In [79]:
faculty = []
for i in range(2627):
    faculty.append(faker.unique.random_int(min = 60000, max = 90000))

In [80]:
faculty_designations = ["Professor", "Associate Professor", "Assistant Professor", "Adjunct Professor", "Lecturer",
                        "Senior Lecturer", "Instructor", "Visiting Professor", "Emeritus Professor", "Research Professor", 
                        "Clinical Professor", "Teaching Assistant", "Research Assistant", "Postdoctoral Fellow", 
                        "Assistant Dean", "Department Chair", "Academic Advisor", "Labotrian", "Assistant Labotrian", "coordinator", "HOD",
                        "Examination Department", "Administration" ]

In [81]:
first_name = []
last_name = []
phone = []
email = []
department = []
date_joining = []
designation = []

In [82]:
for i in range(2627):
    first_name.append(faker.first_name())
    last_name.append(faker.last_name())
    phone.append(faker.phone_number())
    email.append(faker.email())
    department.append(random.choice(department_name))
    date_joining.append(faker.date_between_dates("-25y", "-1y"))
    designation.append(random.choice(faculty_designations))

In [83]:
print(len(first_name))

2627

In [84]:
faculty_ = {"id_": faculty, "first_name": first_name, "last_name": last_name , "phone": phone, "email": email, 
           "department": department, "date_joining": date_joining, "designation": designation}

In [85]:
df_faculty = pd.DataFrame(faculty_)

In [86]:
df_faculty.to_csv("Faculty.csv")

In [87]:
df_faculty

,id_,first_name,last_name,phone,email,department,date_joining,designation
0,81171,Kara,Merritt,871-542-7698,autumn35@example.org,Library Science,2005-01-14,Professor
1,65015,Eric,Mcgrath,+1-276-529-4307x4432,heather91@example.com,Film Studies,2000-12-24,Academic Advisor
2,70824,Nathaniel,Clark,(303)551-9606,kirk83@example.org,Developmental Biology,2022-10-07,Assistant Professor
3,62063,Kelli,Roach,677.334.4896x3892,anthony53@example.com,Physics,2017-05-12,coordinator
4,77566,Lorraine,Morris,224.669.3881x346,lewisgina@example.com,Animation,2015-11-28,Adjunct Professor
...,...,...,...,...,...,...,...,...
2622,88750,John,Wright,(339)529-2603,eromero@example.com,Environmental Science,2021-05-13,HOD
2623,84577,David,Ryan,296-746-2826,whamilton@example.org,Corporate Law,2007-09-04,Visiting Professor
2624,70063,Victoria,Fox,+1-970-753-7368x12952,michael91@example.net,Art History,2023-04-12,Research Professor
2625,87414,Walter,Fisher,9773530010,edonovan@example.org,Gender Studies,2010-08-22,Assistant Dean
2626,73303,Timothy,Wilson,001-868-822-0062x54001,thomasjeffrey@example.org,Fashion Design,2023-01-06,Examination Department

In [41]:
sum(no_of_students)

37027

# courses

In [88]:
course_id = []
for i in range(560):
    course_id.append(faker.unique.random_int(min = 65000, max = 70000))

In [89]:
len(course)
print(course)

[]

In [90]:
course =  []
standard = []
department = []
duration_in_year = []
eligiblity = []
month_of_commencement = []
semestera_included = []
integration_availability = []
placement_grade_ = []
NAAC_grades = [] 
naac_grades = [ "A++", "A+", "A", "B++", "B+", "B", "C", "D (Not Accredited)" ]

In [91]:
for i in range(112):
    course.append(f"{department_name[i]} Bachelor's")
    standard.append("Bachelor's")
    department.append(department_name[i])
    duration_in_year.append("3rd")
    eligiblity.append("Intermediate")
    month_of_commencement.append("July")
    semestera_included.append(6)
    integration_availability.append("Available")
    placement_grade_.append(random.choice(placement_grade))
    NAAC_grades.append(random.choice(naac_grades))

In [92]:
for i in range(112):
    course.append(f"{department_name[i]} Master's")
    standard.append("Master's")
    department.append(department_name[i])
    duration_in_year.append("2nd")
    eligiblity.append("Bachelor's")
    month_of_commencement.append("August")
    semestera_included.append(4)
    integration_availability.append("Available")
    placement_grade_.append(random.choice(placement_grade))
    NAAC_grades.append(random.choice(naac_grades))

In [93]:
for i in range(112):
    course.append(f"{department_name[i]} PHD")
    standard.append("PHD")
    department.append(department_name[i])
    duration_in_year.append("5th")
    eligiblity.append("Master's")
    month_of_commencement.append("January/Agust")
    semestera_included.append(8)
    integration_availability.append("Available")
    placement_grade_.append(random.choice(placement_grade))
    NAAC_grades.append(random.choice(naac_grades))

In [94]:
for i in range(112):
    course.append(f"{department_name[i]} P.Doc")
    standard.append("P.Doc")
    department.append(department_name[i])
    duration_in_year.append("3nd")
    eligiblity.append("PHD")
    month_of_commencement.append("July")
    semestera_included.append(6)
    integration_availability.append("Available")
    placement_grade_.append(random.choice(placement_grade))
    NAAC_grades.append(random.choice(naac_grades))

In [95]:
for i in range(112):
    course.append(f"{department_name[i]} Diploma")
    standard.append("Diploma")
    department.append(department_name[i])
    duration_in_year.append("2nd")
    eligiblity.append("Intermediate")
    month_of_commencement.append("July")
    semestera_included.append(4)
    integration_availability.append("Available")
    placement_grade_.append(random.choice(placement_grade))
    NAAC_grades.append(random.choice(naac_grades))

In [96]:
courses_ =  {"id_": course_id , "standard": standard, "department": department, "duration_in_year": duration_in_year, 
             "eligiblity": eligiblity, "month_of_commencement": month_of_commencement, "semestera_included": semestera_included,
             "integration_availability" : integration_availability, "placement_grade_": placement_grade_ , "NAAC_grades": NAAC_grades
            }

In [97]:
df_course = pd.DataFrame(courses_)

In [98]:
df_course.to_csv("Course.csv")

In [99]:
df_course

,id_,standard,department,duration_in_year,eligiblity,month_of_commencement,semestera_included,integration_availability,placement_grade_,NAAC_grades
0,69493,Bachelor's,Mathematics,3rd,Intermediate,July,6,Available,A1,B++
1,69512,Bachelor's,Physics,3rd,Intermediate,July,6,Available,A2,B++
2,65566,Bachelor's,Agriculture,3rd,Intermediate,July,6,Available,C,D (Not Accredited)
3,67955,Bachelor's,Animal Science,3rd,Intermediate,July,6,Available,A2,A++
4,67142,Bachelor's,Food Science,3rd,Intermediate,July,6,Available,C,B
...,...,...,...,...,...,...,...,...,...,...
555,66962,Diploma,Corporate Law,2nd,Intermediate,July,4,Available,B1,D (Not Accredited)
556,68724,Diploma,Real Estate Law,2nd,Intermediate,July,4,Available,A3,D (Not Accredited)
557,67837,Diploma,Tax Law,2nd,Intermediate,July,4,Available,B1,D (Not Accredited)
558,66688,Diploma,Maritime Law,2nd,Intermediate,July,4,Available,A3,D (Not Accredited)
559,65808,Diploma,Space Law,2nd,Intermediate,July,4,Available,A2,A

# fees

In [100]:
fee_id = []
for i in range(565):
    fee_id.append(faker.unique.random_int(min = 32500, max = 43000))

In [101]:
len(fee_id)

565

In [102]:
fee_payable_for = []
fee_amount = []

In [103]:
fee_payable_for.extend(course)

In [104]:
fee_payable_for.extend(["Late fee fine", "University property damage", "Attendence Fine", "Extra Cariculum fee", "Examination fee"])

In [105]:
len(fee_payable_for)

565

In [106]:
for i in range(560):
    fee_amount.append(faker.random_int(min = 105 , max = 550))

In [107]:
fee_amount.extend([30, 100, 50, 100, 50])

In [108]:
len(fee_amount)

565

In [109]:
amount_to = []
fee_concession = []
for i in range(560):
    amount_to.append("Adminstration Account")
    fee_concession.append("Available")
for i in range(5):
    amount_to.append("Fund Collection Account") 
    fee_concession.append("Not Available")

In [110]:
len(amount_to)

565

In [111]:
last_revieced_fee = []
for i in range(565):
    last_revieced_fee.append(faker.date_between_dates("-12y" "now"))

In [112]:
len(last_revieced_fee)

565

In [113]:
fee_ = {"id_": fee_id , "amount": fee_amount ,  "fee_payable_for": fee_payable_for, "amount_to": amount_to, "last_revieced_fee": last_revieced_fee}

In [114]:
df_fee = pd.DataFrame(fee_)

In [115]:
df_fee.to_csv("fees.csv")

In [116]:
df_fee

,id_,amount,fee_payable_for,amount_to,last_revieced_fee
0,33413,535,Mathematics Bachelor's,Adminstration Account,2020-09-13
1,34565,315,Physics Bachelor's,Adminstration Account,2021-12-18
2,38195,177,Agriculture Bachelor's,Adminstration Account,2016-07-14
3,34471,168,Animal Science Bachelor's,Adminstration Account,2020-11-23
4,41412,289,Food Science Bachelor's,Adminstration Account,2013-06-21
...,...,...,...,...,...
560,35082,30,Late fee fine,Fund Collection Account,2023-08-06
561,34674,100,University property damage,Fund Collection Account,2013-03-02
562,36216,50,Attendence Fine,Fund Collection Account,2023-02-08
563,35916,100,Extra Cariculum fee,Fund Collection Account,2021-01-24
564,34119,50,Examination fee,Fund Collection Account,2020-01-26

# fee concession

In [18]:

compensate_by = []
authority = ["Humanitarians Funds", "College Funds"]

In [19]:
fee_concession_categories = [ "Merit-based", "Need-based", "Sports", "Cultural", "Differently-abled",
                             "Minority", "Defense personnel children", "Single girl child",  "Alumni child", "Orphan"]
len(fee_concession_categories)

10

In [20]:
discount = [10 , 20 , 25,  33 , 30]
fee_concession_categories_percentage = []

In [21]:
for i in range (10):
    fee_concession_categories_percentage.append(faker.random.choice(discount))

In [22]:
for i in range(10):
    compensate_by.append(random.choice(authority))

In [23]:
fee_concession_id_ = []
for i in range(10):
    fee_concession_id_.append(faker.unique.random_int( min = 1 , max = 10))

In [24]:
fee_concession_ = {"id_": fee_concession_id_, "fee_concession_categories" : fee_concession_categories , "compensate_by" : compensate_by, "fee_concession_categories_percentage": fee_concession_categories_percentage}

In [25]:
df_fee_concession = pd.DataFrame(fee_concession_)

In [26]:
df_fee_concession.to_csv("Fee_concession.csv")

In [27]:
df_fee_concession

,id_,fee_concession_categories,compensate_by,fee_concession_categories_percentage
0,1,Merit-based,College Funds,20
1,4,Need-based,Humanitarians Funds,10
2,2,Sports,College Funds,10
3,9,Cultural,Humanitarians Funds,25
4,6,Differently-abled,Humanitarians Funds,30
5,5,Minority,College Funds,30
6,7,Defense personnel children,Humanitarians Funds,33
7,3,Single girl child,College Funds,25
8,8,Alumni child,Humanitarians Funds,20
9,10,Orphan,Humanitarians Funds,20

# placements

In [28]:
placement_grade = ["A1", "A2", "A3", "B1", "B2", "C"]

In [29]:
Package_in_Dollars = [150000, 100000, 80000, 60000, 50000, 30000]

In [30]:
campus_place = ["Available", "Available", "Available" , "Available", "Available", "Available"]

In [31]:
placements_ = {"placements": placement_grade, "Package_in_Dollars": Package_in_Dollars, "campus_plcement" : campus_place}

In [32]:
df_placements = pd.DataFrame(placements_)

In [33]:
df_placements.to_csv("Placements.csv")

In [34]:
df_placements

  placements  Package_in_Dollars campus_plcement
0         A1              150000       Available
1         A2              100000       Available
2         A3               80000       Available
3         B1               60000       Available
4         B2               50000       Available
5          C               30000       Available

# Students

In [117]:
student_id = []
for i in range(34549):
    student_id.append(faker.unique.random_int(min = 2267500, max= 2303049))

In [151]:
len(student_id)

34549

In [192]:
first_name = []
last_name = []
father_name = []
email = []
phone = []
age = []
state = []
course_opt = []
hostel_no = []
extra_cariculum = []

In [191]:
df_students_["course"].value_counts()

course
Health Law Master's          90
Forestry PHD                 84
Economics PHD                83
Anthropology Diploma         83
Network Security Master's    81
                             ..
Forestry Bachelor's          46
Music P.Doc                  46
Finance Diploma              45
Food Science Master's        45
Animation PHD                44
Name: count, Length: 560, dtype: int64

In [193]:
for i in range(34549):
    first_name.append(faker.first_name())
    last_name.append(faker.last_name())
    father_name.append(faker.name())
    email.append(faker.email())
    phone.append(faker.phone_number())
    age.append(faker.random_int(min = 19, max = 28))
    state.append(f.administrative_unit())
    course_opt.append(random.choice(course))
    hostel_no.append(random.choice(hostel_id))
    extra_cariculum.append(random.choice(extracurricular_activities))

In [ ]:
# faker.name.first()
# print(faker.administrative_unit())

In [194]:
len(first_name)

34549

In [195]:
students_ = {"id_": student_id, "first_name": first_name, "last_name": last_name, "age": age, "father_name": father_name, "email": email, 
             "phone": phone, "state": state, "course": course_opt, "hostel": hostel_no, "extra_cariculum": extra_cariculum}

In [196]:
df_students_ = pd.DataFrame(students_)

In [197]:
df_students_.to_csv("Students.csv")

In [198]:
df_students_

,id_,first_name,last_name,age,father_name,email,phone,state,course,hostel,extra_cariculum
0,2291262,Christopher,Crane,21,Rita Hernandez,hwoodward@example.com,001-459-750-0870x642,Bremen,Public Administration Master's,13543,Travel and Adventure Clubs
1,2271364,Jon,Washington,26,Laurie Conley,esmith@example.org,+1-963-324-6378,Berlin,Urban Planning PHD,13544,Political and Activism Groups
2,2297461,Bradley,Myers,20,Tina Perez,eric74@example.org,(592)419-1372,Thüringen,Archaeology P.Doc,13516,Hiking and Outdoor Activities
3,2268937,Benjamin,Roberts,28,Joel Patterson,qsmith@example.net,001-996-266-1473x226,Mecklenburg-Vorpommern,Medicine Bachelor's,13516,Language and Literature Clubs
4,2301029,Jason,Caldwell,21,Victoria Miller,john71@example.net,961-286-7344x66512,Baden-Württemberg,Education Diploma,13509,Theater and Drama
...,...,...,...,...,...,...,...,...,...,...,...
34544,2296448,Mark,Henderson,21,Megan Carroll,anthony77@example.org,422.474.3860,Baden-Württemberg,Economics P.Doc,13504,Political and Activism Groups
34545,2280459,Jonathan,Erickson,22,Matthew Clark,hgrant@example.org,(595)580-9252x17464,Sachsen,Geography P.Doc,13529,Model United Nations
34546,2297940,Tabitha,Brandt,19,James Greene,mackmary@example.org,513-699-8623x321,Bayern,Statistics Diploma,13504,Animal Rights and Welfare Groups
34547,2282485,Brooke,Griffith,19,Nicole Morgan,bautistaadam@example.net,(973)367-1103,Hessen,Family Law PHD,13542,Astronomy Clubs
34548,2278857,Clayton,Burch,24,Danny Nguyen,zacharystevenson@example.org,001-235-557-5357x63974,Sachsen-Anhalt,Accounting Bachelor's,13550,Cultural and International Clubs

# extra_cariculum_name

In [122]:
extracurricular_activities = ["Sports and Athletics", "Music and Band", "Dance", "Theater and Drama", "Debate and Public Speaking", 
                              "Student Government", "Volunteer Work and Community Service", "Academic Clubs (e.g., Math Club, Science Club)",
                              "Cultural and International Clubs", "Environmental and Sustainability Groups", "Art and Craft",
                              "Photography", "Writing and Journalism", "Entrepreneurship and Business Clubs", "Robotics and Coding Clubs",
                              "Language and Literature Clubs", "Yoga and Meditation", "Travel and Adventure Clubs", "Social and Networking Events",
                              "Health and Wellness Programs", "Film and Media Production",  "Model United Nations", "Peer Tutoring and Mentorship",
                              "Cooking and Culinary Arts", "Gardening and Horticulture", "Chess and Board Games", "Science and Technology Competitions",
                              "Animal Rights and Welfare Groups", "Fitness and Bodybuilding", "Fashion and Design", "Religious and Spiritual Groups",
                              "Book Clubs", "Political and Activism Groups", "Chess and Board Games", "Hiking and Outdoor Activities", "Astronomy Clubs",
                              "Magic and Illusion Clubs", "Quidditch (based on the Harry Potter series)" ]

In [123]:
ec_id = []
for i in range(len(extracurricular_activities)):
    ec_id.append(faker.unique.random_int(min= 150, max= 200))

In [124]:
ec_fee = []
for i in range(len(extracurricular_activities)):
    ec_fee.append(faker.unique.random_int(min = 150, max = 250))

In [125]:
no_of_coches_or_instructor_reuired = []
for i in range(38):
    no_of_coches_or_instructor_reuired.append(faker.random_int(min = 3, max = 16))

In [126]:
cat = ["Conducted By University", "Not Conducted By University"]
Annual_conest = []
for i in range(38):
    Annual_conest.append(faker.random.choice(cat))

In [129]:
extra_curricular = {"id_": ec_id, "extracurricular_activities" : extracurricular_activities, "fees": ec_fee , "instructor_reuired": no_of_coches_or_instructor_reuired, "Annual_conest": Annual_conest}

In [130]:
len(extracurricular_activities)

38

In [131]:
df_extra_curricular = pd.DataFrame(extra_curricular)

In [132]:
df_extra_curricular.to_csv("Extra_curricular.csv")

In [134]:
df_extra_curricular.head()

,id_,extracurricular_activities,fees,instructor_reuired,Annual_conest
0,153,Sports and Athletics,150,16,Conducted By University
1,181,Music and Band,230,13,Conducted By University
2,168,Dance,184,14,Not Conducted By University
3,171,Theater and Drama,232,6,Conducted By University
4,177,Debate and Public Speaking,181,10,Not Conducted By University

# hostel

In [202]:
len(no_of_single_rooms_in_hostel)

27

In [136]:
hostel_id = []
for i in range(27):
    hostel_id.append(faker.unique.random_int(min = 13500 , max = 13550))

In [137]:
hostels = [ "Danube", "Rhine", "Volga", "Seine", "Thames", "Loire", "Elbe", "Tagus", "Po", "Dnieper", "Don", "Oder", "Vistula",
           "Rhone", "Tiber", "Shannon", "Clyde", "Ebro", "Garonne", "Meuse", "Moselle", "Douro", "Guadalquivir", "Arno",
           "Tisza", "Sava", "Drava"]

In [138]:
len(hostels)

27

In [139]:
no_of_floors_in_hostel_building = []
no_of_rooms_in_hostel_building = []

In [140]:
for i in range(27):
    no_of_floors_in_hostel_building.append(faker.random_int(min = 5 , max = 10))

In [141]:
for i in range(27):
    no_of_rooms_in_hostel_building.append(faker.random_int(min = 20 , max = 25))

In [142]:
no_of_single_rooms_in_hostel = []
for i in range(27):
    no_of_single_rooms_in_hostel.append(faker.random_int(min = 30 , max = 40))

In [143]:
year_of_formation = []
for i in range(27):
    year_of_formation.append(faker.date_between_dates("-35y", "-12y"))

In [144]:
warden_name = []
for i in range(27):
    warden_name.append(faker.name())

In [145]:
 hostels_ = {"id_": hostel_id , "hostels": hostels, "floors": no_of_floors_in_hostel_building, "rooms": no_of_rooms_in_hostel_building , "single_rooms": no_of_single_rooms_in_hostel, "year_of_formation" : year_of_formation, "warden" : warden_name   }

In [146]:
df_hostel = pd.DataFrame(hostels_)

In [150]:
df_hostel.to_csv("Hostels.csv")

In [149]:
df_hostel

,id_,hostels,floors,rooms,single_rooms,year_of_formation,warden
0,13517,Danube,5,22,38,1996-05-04,Brian Jones
1,13520,Rhine,5,20,38,2011-02-28,Robert Roy
2,13504,Volga,7,22,30,2012-01-03,Tammy Phillips
3,13543,Seine,5,20,31,2009-11-21,Nancy Sanchez
4,13547,Thames,6,23,35,1996-04-09,Michelle Beck
5,13550,Loire,10,21,33,2005-02-18,Lisa Anderson
6,13528,Elbe,7,21,36,2002-07-03,William Meyer
7,13545,Tagus,7,25,30,2000-03-08,Christy Freeman
8,13502,Po,9,21,30,2009-03-07,Tina Pacheco
9,13538,Dnieper,10,20,33,1997-06-22,John Dawson
10,13527,Don,10,22,30,2004-08-26,Lisa Whitaker
11,13501,Oder,9,20,33,1999-03-03,Stacy Anthony
12,13509,Vistula,7,20,31,2007-12-20,Katie Brewer
13,13505,Rhone,10,25,31,1990-02-16,Jason Carroll
14,13516,Tiber,9,21,32,2005-04-07,April Woods
15,13503,Shannon,9,23,32,1997-01-05,Samantha Morgan
16,13510,Clyde,9,21,32,1990-08-20,Jerry Cooper
17,13530,Ebro,9,20,32,1995-09-28,Reginald Kane
18,13544,Garonne,7,20,33,1992-12-19,Kristen Torres
19,13529,Meuse,8,25,30,1998-01-23,Michael Trujillo
20,13542,Moselle,8,22,30,1996-03-25,Jason Ritter
21,13508,Douro,6,20,35,1990-10-10,Laura Anderson
22,13515,Guadalquivir,10,23,34,1991-05-05,Billy Le
23,13533,Arno,10,24,34,1993-05-20,Scott Howard
24,13532,Tisza,6,24,38,2009-05-26,Angela Brooks
25,13548,Sava,5,25,31,1991-04-28,Kevin Flores
26,13518,Drava,7,25,33,2009-07-23,Angela Rich

In [151]:
import pandas as pd

In [160]:
Hostels = pd.read_csv("Hostels.csv")

In [161]:
Fees = pd.read_csv("fees.csv")

In [162]:
Extra_curricular = pd.read_csv("Extra_curricular.csv")

In [163]:
Courses = pd.read_csv("Course.csv")

In [199]:
Students = pd.read_csv("Students.csv")

In [165]:
Fee_concession = pd.read_csv("Fee_concession.csv")

In [166]:
Faculty = pd.read_csv("Faculty.csv")

In [167]:
Departments = pd.read_csv("Departments.csv")

In [205]:
Placements = pd.read_csv("Placements.csv")

In [180]:
import mysql.connector

# Define MySQL connection parameters
DB_USER = 'root'
DB_PASSWORD = 'Sarvagy7.7'
DB_HOST = '127.0.0.1'

# Connect to MySQL server
connection = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="Sarvagya7.7"
)

# Create a new database
new_database_name = 'Univercity_of_Rotenburg'
cursor = connection.cursor()
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {new_database_name}")

print(f"Database '{new_database_name}' created successfully!")

# Close cursor and connection
cursor.close()
connection.close()

Database 'Univercity_of_Rotenburg' created successfully!

In [181]:
from sqlalchemy import create_engine

# Define MySQL connection parameters
DB_USER = 'your_username'
DB_PASSWORD = 'your_password'
DB_HOST = 'localhost'
DB_PORT = '3306'
DB_NAME = 'your_database_name'

# Create SQLAlchemy engine
engine = create_engine(f"mysql+mysqlconnector://root:Sarvagya7.7@127.0.0.1:3306/Univercity_of_Rotenburg")

# Define table name
table_name = "Hostels"

# Load DataFrame into MySQL database
Hostels.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\784631969.py:17: UserWarning: The provided table name 'Hostels' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Hostels.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

In [182]:
Fees.to_sql(name="Fees", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\4264510102.py:1: UserWarning: The provided table name 'Fees' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Fees.to_sql(name="Fees", con=engine, if_exists='replace', index=False)

In [183]:
Extra_curricular.to_sql(name="Extra_curricular", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\399353274.py:1: UserWarning: The provided table name 'Extra_curricular' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Extra_curricular.to_sql(name="Extra_curricular", con=engine, if_exists='replace', index=False)

In [184]:
Courses.to_sql(name="Courses", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\888213647.py:1: UserWarning: The provided table name 'Courses' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Courses.to_sql(name="Courses", con=engine, if_exists='replace', index=False)

In [200]:
Students.to_sql(name="Students", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\1286593136.py:1: UserWarning: The provided table name 'Students' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Students.to_sql(name="Students", con=engine, if_exists='replace', index=False)

In [186]:
Fee_concession.to_sql(name="Fee_concession", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\627831926.py:1: UserWarning: The provided table name 'Fee_concession' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Fee_concession.to_sql(name="Fee_concession", con=engine, if_exists='replace', index=False)

In [187]:
Faculty.to_sql(name="Faculty", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\3520771037.py:1: UserWarning: The provided table name 'Faculty' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Faculty.to_sql(name="Faculty", con=engine, if_exists='replace', index=False)

In [188]:
Departments.to_sql(name="Departments", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\1028598609.py:1: UserWarning: The provided table name 'Departments' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Departments.to_sql(name="Departments", con=engine, if_exists='replace', index=False)

In [189]:
Placements.to_sql(name="Placements", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\2135735938.py:1: UserWarning: The provided table name 'Placements' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Placements.to_sql(name="Placements", con=engine, if_exists='replace', index=False)

In [190]:
Hostels.to_sql(name="Hostel", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\1770598938.py:1: UserWarning: The provided table name 'Hostel' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Hostels.to_sql(name="Hostel", con=engine, if_exists='replace', index=False)

In [204]:
df_stream.to_sql(name="Streams", con=engine, if_exists='replace', index=False)

print("DataFrame loaded into MySQL database successfully!")

DataFrame loaded into MySQL database successfully!

C:\Users\cools\AppData\Local\Temp\ipykernel_23136\1290746892.py:1: UserWarning: The provided table name 'Streams' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_stream.to_sql(name="Streams", con=engine, if_exists='replace', index=False)